; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=310, out_folder=./training, instance_id=19, seed=2043, goal_proportion=0.03

(define (problem blocksworld-19)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 - object)
 (:init 
    (arm-empty)
    (clear b64)
    (on b64 b9)
    (on b9 b147)
    (on-table b147)
    (clear b43)
    (on b43 b238)
    (on b238 b148)
    (on-table b148)
    (clear b237)
    (on b237 b292)
    (on b292 b299)
    (on b299 b209)
    (on-table b209)
    (clear b118)
    (on b118 b103)
    (on-table b103)
    (clear b206)
    (on-table b206)
    (clear b182)
    (on b182 b32)
    (on b32 b17)
    (on b17 b87)
    (on-table b87)
    (clear b29)
    (on-table b29)
    (clear b232)
    (on b232 b300)
    (on b300 b241)
    (on-table b241)
    (clear b4)
    (on b4 b303)
    (on-table b303)
    (clear b203)
    (on-table b203)
    (clear b58)
    (on-table b58)
    (clear b126)
    (on b126 b287)
    (on b287 b296)
    (on-table b296)
    (clear b80)
    (on b80 b199)
    (on-table b199)
    (clear b69)
    (on b69 b214)
    (on b214 b76)
    (on-table b76)
    (clear b98)
    (on b98 b5)
    (on b5 b171)
    (on-table b171)
    (clear b306)
    (on-table b306)
    (clear b264)
    (on b264 b61)
    (on-table b61)
    (clear b293)
    (on b293 b88)
    (on b88 b224)
    (on b224 b86)
    (on b86 b262)
    (on-table b262)
    (clear b52)
    (on b52 b22)
    (on-table b22)
    (clear b115)
    (on b115 b268)
    (on b268 b180)
    (on-table b180)
    (clear b91)
    (on-table b91)
    (clear b204)
    (on b204 b250)
    (on-table b250)
    (clear b158)
    (on b158 b16)
    (on b16 b219)
    (on b219 b189)
    (on-table b189)
    (clear b99)
    (on-table b99)
    (clear b40)
    (on-table b40)
    (clear b48)
    (on-table b48)
    (clear b108)
    (on b108 b62)
    (on-table b62)
    (clear b124)
    (on-table b124)
    (clear b57)
    (on b57 b213)
    (on b213 b26)
    (on b26 b270)
    (on-table b270)
    (clear b92)
    (on b92 b256)
    (on b256 b252)
    (on b252 b54)
    (on-table b54)
    (clear b77)
    (on b77 b141)
    (on-table b141)
    (clear b175)
    (on-table b175)
    (clear b208)
    (on b208 b12)
    (on b12 b280)
    (on-table b280)
    (clear b283)
    (on b283 b153)
    (on b153 b205)
    (on b205 b10)
    (on b10 b150)
    (on-table b150)
    (clear b84)
    (on b84 b210)
    (on b210 b1)
    (on-table b1)
    (clear b106)
    (on b106 b302)
    (on b302 b228)
    (on b228 b249)
    (on-table b249)
    (clear b96)
    (on b96 b173)
    (on b173 b90)
    (on b90 b169)
    (on b169 b207)
    (on b207 b70)
    (on b70 b55)
    (on b55 b220)
    (on b220 b89)
    (on b89 b63)
    (on-table b63)
    (clear b130)
    (on b130 b2)
    (on b2 b105)
    (on b105 b282)
    (on-table b282)
    (clear b196)
    (on b196 b246)
    (on b246 b253)
    (on b253 b3)
    (on b3 b8)
    (on b8 b162)
    (on b162 b244)
    (on b244 b198)
    (on b198 b160)
    (on-table b160)
    (clear b154)
    (on b154 b212)
    (on b212 b255)
    (on b255 b112)
    (on b112 b27)
    (on b27 b202)
    (on b202 b271)
    (on b271 b305)
    (on-table b305)
    (clear b301)
    (on b301 b191)
    (on b191 b82)
    (on-table b82)
    (clear b75)
    (on b75 b230)
    (on-table b230)
    (clear b174)
    (on b174 b66)
    (on b66 b7)
    (on b7 b272)
    (on b272 b101)
    (on b101 b97)
    (on b97 b133)
    (on b133 b47)
    (on-table b47)
    (clear b166)
    (on b166 b266)
    (on b266 b254)
    (on b254 b263)
    (on b263 b95)
    (on b95 b215)
    (on b215 b217)
    (on b217 b25)
    (on-table b25)
    (clear b278)
    (on b278 b72)
    (on b72 b23)
    (on b23 b46)
    (on-table b46)
    (clear b120)
    (on b120 b170)
    (on b170 b276)
    (on-table b276)
    (clear b269)
    (on b269 b107)
    (on b107 b104)
    (on b104 b102)
    (on b102 b290)
    (on b290 b37)
    (on b37 b221)
    (on b221 b67)
    (on-table b67)
    (clear b156)
    (on b156 b39)
    (on b39 b190)
    (on b190 b222)
    (on b222 b260)
    (on b260 b181)
    (on b181 b225)
    (on b225 b94)
    (on-table b94)
    (clear b140)
    (on b140 b194)
    (on b194 b310)
    (on b310 b307)
    (on b307 b13)
    (on-table b13)
    (clear b127)
    (on b127 b161)
    (on b161 b188)
    (on b188 b275)
    (on b275 b167)
    (on b167 b233)
    (on b233 b119)
    (on b119 b285)
    (on-table b285)
    (clear b289)
    (on b289 b298)
    (on b298 b14)
    (on-table b14)
    (clear b122)
    (on b122 b259)
    (on-table b259)
    (clear b297)
    (on b297 b279)
    (on b279 b245)
    (on b245 b93)
    (on b93 b36)
    (on b36 b251)
    (on-table b251)
    (clear b6)
    (on b6 b265)
    (on b265 b35)
    (on b35 b267)
    (on b267 b229)
    (on b229 b73)
    (on b73 b132)
    (on-table b132)
    (clear b151)
    (on-table b151)
    (clear b177)
    (on b177 b131)
    (on b131 b53)
    (on b53 b197)
    (on b197 b41)
    (on b41 b19)
    (on b19 b38)
    (on-table b38)
    (clear b60)
    (on b60 b152)
    (on b152 b186)
    (on b186 b134)
    (on b134 b155)
    (on b155 b51)
    (on b51 b273)
    (on b273 b309)
    (on b309 b234)
    (on b234 b178)
    (on b178 b211)
    (on b211 b113)
    (on-table b113)
    (clear b11)
    (on b11 b185)
    (on b185 b257)
    (on b257 b24)
    (on-table b24)
    (clear b291)
    (on-table b291)
    (clear b85)
    (on b85 b138)
    (on b138 b195)
    (on b195 b184)
    (on b184 b176)
    (on b176 b123)
    (on b123 b59)
    (on b59 b149)
    (on b149 b235)
    (on-table b235)
    (clear b109)
    (on b109 b33)
    (on b33 b100)
    (on b100 b294)
    (on b294 b157)
    (on b157 b117)
    (on-table b117)
    (clear b243)
    (on b243 b193)
    (on-table b193)
    (clear b81)
    (on b81 b83)
    (on-table b83)
    (clear b45)
    (on b45 b65)
    (on b65 b111)
    (on b111 b18)
    (on-table b18)
    (clear b121)
    (on b121 b15)
    (on b15 b258)
    (on b258 b143)
    (on b143 b192)
    (on b192 b110)
    (on b110 b71)
    (on b71 b142)
    (on-table b142)
    (clear b78)
    (on b78 b277)
    (on-table b277)
    (clear b247)
    (on-table b247)
    (clear b218)
    (on b218 b242)
    (on b242 b28)
    (on b28 b79)
    (on b79 b308)
    (on b308 b139)
    (on b139 b239)
    (on b239 b200)
    (on b200 b128)
    (on-table b128)
    (clear b49)
    (on b49 b30)
    (on b30 b145)
    (on b145 b304)
    (on b304 b135)
    (on b135 b187)
    (on b187 b165)
    (on b165 b172)
    (on b172 b56)
    (on b56 b20)
    (on-table b20)
    (clear b114)
    (on-table b114)
    (clear b164)
    (on b164 b42)
    (on b42 b179)
    (on b179 b201)
    (on b201 b146)
    (on b146 b44)
    (on-table b44)
    (clear b284)
    (on-table b284)
    (clear b159)
    (on b159 b227)
    (on b227 b116)
    (on b116 b274)
    (on b274 b168)
    (on-table b168)
    (clear b31)
    (on b31 b34)
    (on-table b34)
    (clear b21)
    (on b21 b226)
    (on-table b226)
    (clear b163)
    (on b163 b137)
    (on b137 b129)
    (on-table b129)
    (clear b231)
    (on b231 b50)
    (on b50 b281)
    (on-table b281)
    (clear b144)
    (on b144 b223)
    (on b223 b183)
    (on b183 b240)
    (on-table b240)
    (clear b74)
    (on b74 b261)
    (on b261 b136)
    (on b136 b236)
    (on b236 b68)
    (on b68 b216)
    (on b216 b288)
    (on b288 b286)
    (on b286 b295)
    (on b295 b125)
    (on b125 b248)
    (on-table b248))
 (:goal  (and 
    (clear b7)
    (on b7 b4)
    (on b4 b1)
    (on b1 b8)
    (on b8 b5)
    (on b5 b3)
    (on b3 b6)
    (on b6 b2)
    (on-table b2)
    (clear b9)
    (on-table b9))))

; plan
1. (unstack b130 b2)
   deleted: (on b130 b2) (clear b130) (arm-empty)
   added: (holding b130) (clear b2)
   goals met: 0 of 11
2. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 0 of 11
3. (unstack b2 b105)
   deleted: (on b2 b105) (clear b2) (arm-empty)
   added: (holding b2) (clear b105)
   goals met: 0 of 11
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 11
5. (unstack b174 b66)
   deleted: (on b174 b66) (clear b174) (arm-empty)
   added: (holding b174) (clear b66)
   goals met: 1 of 11
6. (putdown b174)
   deleted: (holding b174)
   added: (clear b174) (arm-empty) (on-table b174)
   goals met: 1 of 11
7. (unstack b196 b246)
   deleted: (on b196 b246) (clear b196) (arm-empty)
   added: (holding b196) (clear b246)
   goals met: 1 of 11
8. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 1 of 11
9. (unstack b246 b253)
   deleted: (on b246 b253) (clear b246) (arm-empty)
   added: (holding b246) (clear b253)
   goals met: 1 of 11
10. (putdown b246)
   deleted: (holding b246)
   added: (clear b246) (arm-empty) (on-table b246)
   goals met: 1 of 11
11. (unstack b253 b3)
   deleted: (on b253 b3) (clear b253) (arm-empty)
   added: (holding b253) (clear b3)
   goals met: 1 of 11
12. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 1 of 11
13. (unstack b64 b9)
   deleted: (on b64 b9) (clear b64) (arm-empty)
   added: (holding b64) (clear b9)
   goals met: 2 of 11
14. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 2 of 11
15. (unstack b9 b147)
   deleted: (on b9 b147) (clear b9) (arm-empty)
   added: (holding b9) (clear b147)
   goals met: 1 of 11
16. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 11
17. (unstack b66 b7)
   deleted: (on b66 b7) (clear b66) (arm-empty)
   added: (holding b66) (clear b7)
   goals met: 4 of 11
18. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 4 of 11
19. (unstack b84 b210)
   deleted: (on b84 b210) (clear b84) (arm-empty)
   added: (holding b84) (clear b210)
   goals met: 4 of 11
20. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 4 of 11
21. (unstack b210 b1)
   deleted: (on b210 b1) (clear b210) (arm-empty)
   added: (holding b210) (clear b1)
   goals met: 4 of 11
22. (putdown b210)
   deleted: (holding b210)
   added: (clear b210) (arm-empty) (on-table b210)
   goals met: 4 of 11
23. (unstack b98 b5)
   deleted: (on b98 b5) (clear b98) (arm-empty)
   added: (holding b98) (clear b5)
   goals met: 4 of 11
24. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 4 of 11
25. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 4 of 11
26. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 11
27. (unstack b6 b265)
   deleted: (on b6 b265) (clear b6) (arm-empty)
   added: (holding b6) (clear b265)
   goals met: 4 of 11
28. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 5 of 11
29. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 11
30. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 6 of 11
31. (unstack b5 b171)
   deleted: (on b5 b171) (clear b5) (arm-empty)
   added: (holding b5) (clear b171)
   goals met: 6 of 11
32. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 7 of 11
33. (unstack b8 b162)
   deleted: (on b8 b162) (clear b8) (arm-empty)
   added: (holding b8) (clear b162)
   goals met: 7 of 11
34. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 8 of 11
35. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 11
36. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 9 of 11
37. (unstack b4 b303)
   deleted: (on b4 b303) (clear b4) (arm-empty)
   added: (holding b4) (clear b303)
   goals met: 9 of 11
38. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 10 of 11
39. (unstack b7 b272)
   deleted: (on b7 b272) (clear b7) (arm-empty)
   added: (holding b7) (clear b272)
   goals met: 9 of 11
40. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 11 of 11
